PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER_SWEVG */
#define TIMER_SWEVG_UPG                          BIT(0)                                 /*!< update event generate */
#define TIMER_SWEVG_CH0G                         BIT(1)                                 /*!< channel 0 capture or compare event generation */
#define TIMER_SWEVG_CH1G                         BIT(2)                                 /*!< channel 1 capture or compare event generation */
#define TIMER_SWEVG_CH2G                         BIT(3)                                 /*!< channel 2 capture or compare event generation */
#define TIMER_SWEVG_CH3G                         BIT(4)                                 /*!< channel 3 capture or compare event generation */
#define TIMER_SWEVG_CMTG                         BIT(5)                                 /*!< channel commutation event generation */
#define TIMER_SWEVG_TRGG                         BIT(6)                                 /*!< trigger event generation */
#define TIMER_SWEVG_BRKG                         BIT(7)                                 /*!< break event generation */

/* TIMER_CHCTL0 */
/* output compare mode */
#define TIMER_CHCTL0_CH0MS                       BITS(0,1)                              /*!< channel 0 mode selection */
#define TIMER_CHCTL0_CH0COMFEN                   BIT(2)                                 /*!< channel 0 output compare fast enable */
#define TIMER_CHCTL0_CH0COMSEN                   BIT(3)                                 /*!< channel 0 output compare shadow enable */
#define TIMER_CHCTL0_CH0COMCTL                   BITS(4,6)                              /*!< channel 0 output compare mode */
#define TIMER_CHCTL0_CH0COMCEN                   BIT(7)                                 /*!< channel 0 output compare clear enable */
#define TIMER_CHCTL0_CH1MS                       BITS(8,9)                              /*!< channel 1 mode selection */
#define TIMER_CHCTL0_CH1COMFEN                   BIT(10)                                /*!< channel 1 output compare fast enable */
#define TIMER_CHCTL0_CH1COMSEN                   BIT(11)                                /*!< channel 1 output compare shadow enable */
#define TIMER_CHCTL0_CH1COMCTL                   BITS(12,14)                            /*!< channel 1 output compare mode */
#define TIMER_CHCTL0_CH1COMCEN                   BIT(15)                                /*!< channel 1 output compare clear enable */
/* input capture mode */
#define TIMER_CHCTL0_CH0CAPPSC                   BITS(2,3)                              /*!< channel 0 input capture prescaler */
#define TIMER_CHCTL0_CH0CAPFLT                   BITS(4,7)                              /*!< channel 0 input capture filter control */
#define TIMER_CHCTL0_CH1CAPPSC                   BITS(10,11)                            /*!< channel 1 input capture prescaler */
#define TIMER_CHCTL0_CH1CAPFLT                   BITS(12,15)                            /*!< channel 1 input capture filter control */

/* TIMER_CHCTL1 */
/* output compare mode */
#define TIMER_CHCTL1_CH2MS                       BITS(0,1)                              /*!< channel 2 mode selection */
#define TIMER_CHCTL1_CH2COMFEN                   BIT(2)                                 /*!< channel 2 output compare fast enable */
#define TIMER_CHCTL1_CH2COMSEN                   BIT(3)                                 /*!< channel 2 output compare shadow enable */
#define TIMER_CHCTL1_CH2COMCTL                   BITS(4,6)                              /*!< channel 2 output compare mode */
#define TIMER_CHCTL1_CH2COMCEN                   BIT(7)                                 /*!< channel 2 output compare clear enable */
#define TIMER_CHCTL1_CH3MS                       BITS(8,9)                              /*!< channel 3 mode selection */
#define TIMER_CHCTL1_CH3COMFEN                   BIT(10)                                /*!< channel 3 output compare fast enable */
#define TIMER_CHCTL1_CH3COMSEN                   BIT(11)                                /*!< channel 3 output compare shadow enable */
#define TIMER_CHCTL1_CH3COMCTL                   BITS(12,14)                            /*!< channel 3 output compare mode */
#define TIMER_CHCTL1_CH3COMCEN                   BIT(15)                                /*!< channel 3 output compare clear enable */
/* input capture mode */
#define TIMER_CHCTL1_CH2CAPPSC                   BITS(2,3)                              /*!< channel 2 input capture prescaler */
#define TIMER_CHCTL1_CH2CAPFLT                   BITS(4,7)                              /*!< channel 2 input capture filter control */
#define TIMER_CHCTL1_CH3CAPPSC                   BITS(10,11)                            /*!< channel 3 input capture prescaler */
#define TIMER_CHCTL1_CH3CAPFLT                   BITS(12,15)                            /*!< channel 3 input capture filter control */

/* TIMER_CHCTL2 */
#define TIMER_CHCTL2_CH0EN                       BIT(0)                                 /*!< channel 0 capture/compare function enable */
#define TIMER_CHCTL2_CH0P                        BIT(1)                                 /*!< channel 0 capture/compare function polarity */
#define TIMER_CHCTL2_CH0NEN                      BIT(2)                                 /*!< channel 0 complementary output enable */
#define TIMER_CHCTL2_CH0NP                       BIT(3)                                 /*!< channel 0 complementary output polarity */
#define TIMER_CHCTL2_CH1EN                       BIT(4)                                 /*!< channel 1 capture/compare function enable  */
#define TIMER_CHCTL2_CH1P                        BIT(5)                                 /*!< channel 1 capture/compare function polarity */
#define TIMER_CHCTL2_CH1NEN                      BIT(6)                                 /*!< channel 1 complementary output enable */
#define TIMER_CHCTL2_CH1NP                       BIT(7)                                 /*!< channel 1 complementary output polarity */
#define TIMER_CHCTL2_CH2EN                       BIT(8)                                 /*!< channel 2 capture/compare function enable  */
#define TIMER_CHCTL2_CH2P                        BIT(9)                                 /*!< channel 2 capture/compare function polarity */
#define TIMER_CHCTL2_CH2NEN                      BIT(10)                                /*!< channel 2 complementary output enable */
#define TIMER_CHCTL2_CH2NP                       BIT(11)                                /*!< channel 2 complementary output polarity */
#define TIMER_CHCTL2_CH3EN                       BIT(12)                                /*!< channel 3 capture/compare function enable  */
#define TIMER_CHCTL2_CH3P                        BIT(13)                                /*!< channel 3 capture/compare function polarity */
#define TIMER_CHCTL2_CH3NP                       BIT(15)                                /*!< channel 3 complementary output polarity */

