PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER_CNT */
#define TIMER_CNT_CNT16                          BITS(0,15)                             /*!< 16 bit timer counter */
#define TIMER_CNT_CNT32                          BITS(0,31)                             /*!< 32 bit(TIMER1) timer counter */

/* TIMER_PSC */
#define TIMER_PSC_PSC                            BITS(0,15)                             /*!< prescaler value of the counter clock */

/* TIMER_CAR */
#define TIMER_CAR_CARL16                         BITS(0,15)                             /*!< 16 bit counter auto reload value */
#define TIMER_CAR_CARL32                         BITS(0,31)                             /*!< 32 bit(TIMER1) counter auto reload value */

/* TIMER_CREP */
#define TIMER_CREP_CREP                          BITS(0,7)                              /*!< counter repetition value */

/* TIMER_CH0CV */
#define TIMER_CH0CV_CH0VAL16                     BITS(0,15)                             /*!< 16 bit capture/compare value of channel 0 */
#define TIMER_CH0CV_CH0VAL32                     BITS(0,31)                             /*!< 32 bit(TIMER1) capture/compare value of channel 0 */

/* TIMER_CH1CV */
#define TIMER_CH1CV_CH1VAL16                     BITS(0,15)                             /*!< 16 bit capture/compare value of channel 1 */
#define TIMER_CH1CV_CH1VAL32                     BITS(0,31)                             /*!< 32 bit(TIMER1) capture/compare value of channel 1 */

/* TIMER_CH2CV */
#define TIMER_CH2CV_CH2VAL16                     BITS(0,15)                             /*!< 16 bit capture/compare value of channel 2 */
#define TIMER_CH2CV_CH2VAL32                     BITS(0,31)                             /*!< 32 bit(TIMER1) capture/compare value of channel 2 */

/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL16                     BITS(0,15)                             /*!< 16 bit capture/compare value of channel 3 */
#define TIMER_CH3CV_CH3VAL32                     BITS(0,31)                             /*!< 32 bit(TIMER1) capture/compare value of channel 3 */

/* TIMER_CCHP */
#define TIMER_CCHP_DTCFG                         BITS(0,7)                              /*!< dead time configure */
#define TIMER_CCHP_PROT                          BITS(8,9)                              /*!< complementary register protect control */
#define TIMER_CCHP_IOS                           BIT(10)                                /*!< idle mode off-state configure */
#define TIMER_CCHP_ROS                           BIT(11)                                /*!< run mode off-state configure */
#define TIMER_CCHP_BRKEN                         BIT(12)                                /*!< break enable */
#define TIMER_CCHP_BRKP                          BIT(13)                                /*!< break polarity */
#define TIMER_CCHP_OAEN                          BIT(14)                                /*!< output automatic enable */
#define TIMER_CCHP_POEN                          BIT(15)                                /*!< primary output enable */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA                       BITS(0,4)                              /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC                       BITS(8,12)                             /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                        BITS(0,15)                             /*!< DMA transfer buffer address */

/* TIMER_IRMP */
#define TIMER13_IRMP_CI0_RMP                     BITS(0,1)                              /*!< TIMER13 channel 0 input remap */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                         BIT(0)                                 /*!< the output value selection */
#define TIMER_CFG_CHVSEL                         BIT(1)                                 /*!< write CHxVAL register selection */

/* constants definitions */
/* TIMER state enumeration */
typedef enum {
    HAL_TIMER_STATE_NONE = 0,                                                           /*!< NONE(default value) */
    HAL_TIMER_STATE_RESET,                                                              /*!< RESET */
    HAL_TIMER_STATE_BUSY,                                                               /*!< BUSY */
    HAL_TIMER_STATE_TIMEOUT,                                                            /*!< TIMEOUT */
    HAL_TIMER_STATE_ERROR,                                                              /*!< ERROR */
    HAL_TIMER_STATE_READY                                                               /*!< READY */
} hal_timer_state_enum;

/* TIMER error type enumeration */
typedef enum {
    HAL_TIMER_ERROR_NONE   = (uint32_t)0x00U,                                           /*!< no error */
    HAL_TIMER_ERROR_SYSTEM = (uint32_t)0x01U,                                           /*!< TIMER internal error: if problem of clocking, enable/disable, wrong state */
    HAL_TIMER_ERROR_DMA    = (uint32_t)0x02U,                                           /*!< DMA transfer error */
    HAL_TIMER_ERROR_CONFIG = (uint32_t)0x03U                                            /*!< configuration error occurs */
} hal_timer_error_enum;

/* the service channel x(x=0..3) */
typedef enum {
    HAL_TIMER_SERVICE_CHANNEL_NONE = 0x00,                                              /*!< none channel service */
    HAL_TIMER_SERVICE_CHANNEL_0,                                                        /*!< service channel 0 */
    HAL_TIMER_SERVICE_CHANNEL_1,                                                        /*!< service channel 1 */
    HAL_TIMER_SERVICE_CHANNEL_2,                                                        /*!< service channel 2 */
    HAL_TIMER_SERVICE_CHANNEL_3                                                         /*!< service channel 3 */
} hal_timer_service_channel_enum;

/* TIMER init structure type enumeration */
typedef enum {
    HAL_TIMER_INIT_STRUCT,                                                              /*!< TIMER basic initialize configuration structure */
    HAL_TIMER_INPUT_CAPTURE_STRUCT,                                                     /*!< TIMER input capture configuration structure */
    HAL_TIMER_OUTPUT_COMPARE_STRUCT,                                                    /*!< TIMER output compare configuration structure */
    HAL_TIMER_BREAK_STRUCT,                                                             /*!< TIMER break and complementary channel protection configuration structure */
    HAL_TIMER_CLEAR_SOURCE_STRUCT,                                                      /*!< TIMER OCPRE clear source configuration structure */
    HAL_TIMER_CLOCK_SOURCE_STRUCT,                                                      /*!< TIMER clock source configuration structure */
    HAL_TIMER_SLAVE_MODE_STRUCT,                                                        /*!< TIMER slave mode configuration structure */
    HAL_TIMER_DECODER_STRUCT,                                                           /*!< TIMER decoder mode configuration structure */
    HAL_TIMER_DECODER_DMA_CONFIG_STRUCT,                                                /*!< TIMER decoder mode DMA transfer configuration structure */
    HAL_TIMER_HALL_SENSOR_STRUCT,                                                       /*!< TIMER hall sensor mode configuration structure */
    HAL_TIMER_SINGLE_PULSE_STRUCT,                                                      /*!< TIMER single pulse mode configuration structure */
    HAL_TIMER_DMA_TRANSFER_CONFIG_STRUCT,                                               /*!< TIMER DMA transfer configuration structure */
    HAL_TIMER_IRQ_STRUCT,                                                               /*!< TIMER interrupt user callback function pointer structure */
    HAL_TIMER_DMA_HANDLE_CB_STRUCT,                                                     /*!< TIMER DMA interrupt user callback function pointer structure */
    HAL_TIMER_DEV_STRUCT                                                                /*!< TIMER device information structure */
} hal_timer_struct_type_enum;

/* DMA transfer access start address constant */
#define DMACFG_DMATA(regval)                     (BITS(0, 4) & ((uint32_t)(regval) << 0U))
/* DMA transfer access start address enumeration */
typedef enum {
    TIMER_DMA_START_ADDRESS_CTL0     = DMACFG_DMATA(0),                                 /*!< DMA transfer address is TIMER_CTL0 */
    TIMER_DMA_START_ADDRESS_CTL1     = DMACFG_DMATA(1),                                 /*!< DMA transfer address is TIMER_CTL1 */
    TIMER_DMA_START_ADDRESS_SMCFG    = DMACFG_DMATA(2),                                 /*!< DMA transfer address is TIMER_SMCFG */
    TIMER_DMA_START_ADDRESS_DMAINTEN = DMACFG_DMATA(3),                                 /*!< DMA transfer address is TIMER_DMAINTEN */
    TIMER_DMA_START_ADDRESS_INTF     = DMACFG_DMATA(4),                                 /*!< DMA transfer address is TIMER_INTF */
    TIMER_DMA_START_ADDRESS_SWEVG    = DMACFG_DMATA(5),                                 /*!< DMA transfer address is TIMER_SWEVG */
    TIMER_DMA_START_ADDRESS_CHCTL0   = DMACFG_DMATA(6),                                 /*!< DMA transfer address is TIMER_CHCTL0 */
    TIMER_DMA_START_ADDRESS_CHCTL1   = DMACFG_DMATA(7),                                 /*!< DMA transfer address is TIMER_CHCTL1 */
    TIMER_DMA_START_ADDRESS_CHCTL2   = DMACFG_DMATA(8),                                 /*!< DMA transfer address is TIMER_CHCTL2 */
    TIMER_DMA_START_ADDRESS_CNT      = DMACFG_DMATA(9),                                 /*!< DMA transfer address is TIMER_CNT */
    TIMER_DMA_START_ADDRESS_PSC      = DMACFG_DMATA(10),                                /*!< DMA transfer address is TIMER_PSC */
    TIMER_DMA_START_ADDRESS_CAR      = DMACFG_DMATA(11),                                /*!< DMA transfer address is TIMER_CAR */
    TIMER_DMA_START_ADDRESS_CREP     = DMACFG_DMATA(12),                                /*!< DMA transfer address is TIMER_CREP */
    TIMER_DMA_START_ADDRESS_CH0CV    = DMACFG_DMATA(13),                                /*!< DMA transfer address is TIMER_CH0CV */
    TIMER_DMA_START_ADDRESS_CH1CV    = DMACFG_DMATA(14),                                /*!< DMA transfer address is TIMER_CH1CV */
    TIMER_DMA_START_ADDRESS_CH2CV    = DMACFG_DMATA(15),                                /*!< DMA transfer address is TIMER_CH2CV */
    TIMER_DMA_START_ADDRESS_CH3CV    = DMACFG_DMATA(16),                                /*!< DMA transfer address is TIMER_CH3CV */
    TIMER_DMA_START_ADDRESS_CCHP     = DMACFG_DMATA(17),                                /*!< DMA transfer address is TIMER_CCHP */
    TIMER_DMA_START_ADDRESS_DMACFG   = DMACFG_DMATA(18)                                 /*!< DMA transfer address is TIMER_DMACFG */
} hal_timer_dma_transfer_start_address_enum;

/* DMA transfer access length constant */
#define DMACFG_DMATC(regval)                     (BITS(8, 12) & ((uint32_t)(regval) << 8U))
/* DMA transfer access length enumeration */
typedef enum {
    TIMER_DMACFG_DMATC_1TRANSFER  = DMACFG_DMATC(0),                                    /*!< DMA transfer 1 time */
    TIMER_DMACFG_DMATC_2TRANSFER  = DMACFG_DMATC(1),                                    /*!< DMA transfer 2 time */
    TIMER_DMACFG_DMATC_3TRANSFER  = DMACFG_DMATC(2),                                    /*!< DMA transfer 3 time */
    TIMER_DMACFG_DMATC_4TRANSFER  = DMACFG_DMATC(3),                                    /*!< DMA transfer 4 time */
    TIMER_DMACFG_DMATC_5TRANSFER  = DMACFG_DMATC(4),                                    /*!< DMA transfer 5 time */
    TIMER_DMACFG_DMATC_6TRANSFER  = DMACFG_DMATC(5),                                    /*!< DMA transfer 6 time */
    TIMER_DMACFG_DMATC_7TRANSFER  = DMACFG_DMATC(6),                                    /*!< DMA transfer 7 time */
    TIMER_DMACFG_DMATC_8TRANSFER  = DMACFG_DMATC(7),                                    /*!< DMA transfer 8 time */
    TIMER_DMACFG_DMATC_9TRANSFER  = DMACFG_DMATC(8),                                    /*!< DMA transfer 9 time */
    TIMER_DMACFG_DMATC_10TRANSFER = DMACFG_DMATC(9),                                    /*!< DMA transfer 10 time */
    TIMER_DMACFG_DMATC_11TRANSFER = DMACFG_DMATC(10),                                   /*!< DMA transfer 11 time */
    TIMER_DMACFG_DMATC_12TRANSFER = DMACFG_DMATC(11),                                   /*!< DMA transfer 12 time */
    TIMER_DMACFG_DMATC_13TRANSFER = DMACFG_DMATC(12),                                   /*!< DMA transfer 13 time */
    TIMER_DMACFG_DMATC_14TRANSFER = DMACFG_DMATC(13),                                   /*!< DMA transfer 14 time */
    TIMER_DMACFG_DMATC_15TRANSFER = DMACFG_DMATC(14),                                   /*!< DMA transfer 15 time */
    TIMER_DMACFG_DMATC_16TRANSFER = DMACFG_DMATC(15),                                   /*!< DMA transfer 16 time */
    TIMER_DMACFG_DMATC_17TRANSFER = DMACFG_DMATC(16),                                   /*!< DMA transfer 17 time */
    TIMER_DMACFG_DMATC_18TRANSFER = DMACFG_DMATC(17)                                    /*!< DMA transfer 18 time */
} hal_timer_dma_transfer_length_enum;

/* TIMER decoder mode DMA transfer configuration structure */
typedef struct {
    uint32_t *mem_addr0;                                                                /*!< TIMER decoder mode DMA transfer memory address 0 */
    uint32_t *mem_addr1;                                                                /*!< TIMER decoder mode DMA transfer memory address 1 */
    uint16_t length;                                                                    /*!< TIMER DMA transfer length */
} hal_timer_decoder_dma_config_struct;

