PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER DMA transfer configuration structure*/
typedef struct {
    hal_timer_dma_transfer_start_address_enum start_addr;                               /*!< TIMER DMA transfer access start address */
    uint32_t *mem_addr;                                                                 /*!< TIMER DMA transfer memory address */
    hal_timer_dma_transfer_length_enum length;                                          /*!< TIMER DMA transfer access length */
} hal_timer_dma_transfer_config_struct;

/* TIMER interrupt user callback function pointer structure */
typedef struct {
    __IO hal_irq_handle_cb update_handle;                                               /*!< TIMER update interrupt callback function */
    __IO hal_irq_handle_cb channelx_capture_handle;                                     /*!< TIMER channel interrupt for input capture callback function */
    __IO hal_irq_handle_cb channelx_compare_handle;                                     /*!< TIMER channel interrupt for output compare callback function */
    __IO hal_irq_handle_cb commutation_handle;                                          /*!< TIMER commutation interrupt callback function */
    __IO hal_irq_handle_cb trigger_handle;                                              /*!< TIMER trigger interrupt callback function */
    __IO hal_irq_handle_cb break_handle;                                                /*!< TIMER break interrupt callback function */
} hal_timer_irq_struct;

/* TIMER DMA interrupt callback function pointer structure */
typedef void (*hal_timer_dma_handle_cb)(void *ptr);
typedef struct {
    __IO hal_timer_dma_handle_cb update_dma_full_transcom_handle;                       /*!< TIMER DMA transfer complete interrupt handler for TIMER update DMA request */
    __IO hal_timer_dma_handle_cb channelx_capture_dma_full_transcom_handle;             /*!< TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request */
    __IO hal_timer_dma_handle_cb channelx_compare_dma_full_transcom_handle;             /*!< TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request */
    __IO hal_timer_dma_handle_cb commutation_dma_full_transcom_handle;                  /*!< TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request */
    __IO hal_timer_dma_handle_cb trigger_dma_full_transcom_handle;                      /*!< TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request */
    __IO hal_timer_dma_handle_cb error_handle;                                          /*!< TIMER DMA transfer error interrupt handler */
} hal_timer_dma_handle_cb_struct;

/* TIMER device information structure*/
typedef struct {
    uint32_t periph;                                                                    /*!< TIMERx(x=0,2,5,13..16) */
    hal_timer_service_channel_enum service_channel;                                     /*!< the service channel x */
    hal_timer_irq_struct           timer_irq;                                           /*!< TIMER interrupt user callback function pointer structure */
    hal_dma_dev_struct             *p_dma_timer[7];                                     /*!< DMA device information structure */
    hal_timer_dma_handle_cb_struct timer_dma;                                           /*!< TIMER DMA interrupt user callback function pointer structure */
    hal_timer_error_enum           error_state;                                         /*!< TIMER error state */
    hal_timer_state_enum           state;                                               /*!< TIMER state */
    hal_mutex_enum                 mutex;
    void                           *priv;                                               /* priv data */
} hal_timer_dev_struct;

/* TIMER counter alignment mode */
#define CTL0_CAM(regval)                         ((uint16_t)(BITS(5, 6) & ((uint32_t)(regval) << 5U)))

/* TIMER clock division */
#define CTL0_CKDIV(regval)                       ((uint16_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))

/* TIMER master mode control */
#define CTL1_MMC(regval)                         (BITS(4, 6) & ((uint32_t)(regval) << 4U))

/* TIMER slave mode */
#define SMCFG_SMC(regval)                        (BITS(0, 2) & ((uint32_t)(regval) << 0U))
#define TIMER_SLAVE_MODE_DISABLE                 SMCFG_SMC(0)                           /*!< slave mode disable */
#define TIMER_QUAD_DECODER_MODE0                 SMCFG_SMC(1)                           /*!< encoder mode 0 */
#define TIMER_QUAD_DECODER_MODE1                 SMCFG_SMC(2)                           /*!< encoder mode 1 */
#define TIMER_QUAD_DECODER_MODE2                 SMCFG_SMC(3)                           /*!< encoder mode 2 */
#define TIMER_SLAVE_MODE_RESTART                 SMCFG_SMC(4)                           /*!< restart mode */
#define TIMER_SLAVE_MODE_PAUSE                   SMCFG_SMC(5)                           /*!< pause mode */
#define TIMER_SLAVE_MODE_EVENT                   SMCFG_SMC(6)                           /*!< event mode */
#define TIMER_SLAVE_MODE_EXTERNAL0               SMCFG_SMC(7)                           /*!< external clock mode 0 */

/* TIMER trigger selection */
#define SMCFG_TRGSEL(regval)                     (BITS(4, 6) & ((uint32_t)(regval) << 4U))
#define TIMER_SMCFG_TRGSEL_ITI0                  SMCFG_TRGSEL(0)                        /*!< internal trigger 0 */
#define TIMER_SMCFG_TRGSEL_ITI1                  SMCFG_TRGSEL(1)                        /*!< internal trigger 1 */
#define TIMER_SMCFG_TRGSEL_ITI2                  SMCFG_TRGSEL(2)                        /*!< internal trigger 2 */
#define TIMER_SMCFG_TRGSEL_ITI3                  SMCFG_TRGSEL(3)                        /*!< internal trigger 3 */
#define TIMER_SMCFG_TRGSEL_CI0F_ED               SMCFG_TRGSEL(4)                        /*!< TI0 Edge Detector */
#define TIMER_SMCFG_TRGSEL_CI0FE0                SMCFG_TRGSEL(5)                        /*!< filtered TIMER input 0 */
#define TIMER_SMCFG_TRGSEL_CI1FE1                SMCFG_TRGSEL(6)                        /*!< filtered TIMER input 1 */
#define TIMER_SMCFG_TRGSEL_ETIFP                 SMCFG_TRGSEL(7)                        /*!< external trigger */

/* TIMER external trigger prescaler */
#define SMCFG_ETPSC(regval)                      (BITS(12, 13) & ((uint32_t)(regval) << 12U))

/* TIMER protect_mode */
#define CCHP_PROT(regval)                        ((uint16_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))

/* TIMER interrupt enable or disable constant */
#define TIMER_INT_UP                             TIMER_DMAINTEN_UPIE                    /*!< update interrupt */
#define TIMER_INT_CH0                            TIMER_DMAINTEN_CH0IE                   /*!< channel 0 capture/compare interrupt */
#define TIMER_INT_CH1                            TIMER_DMAINTEN_CH1IE                   /*!< channel 1 capture/compare interrupt */
#define TIMER_INT_CH2                            TIMER_DMAINTEN_CH2IE                   /*!< channel 2 capture/compare interrupt */
#define TIMER_INT_CH3                            TIMER_DMAINTEN_CH3IE                   /*!< channel 3 capture/compare interrupt */
#define TIMER_INT_CMT                            TIMER_DMAINTEN_CMTIE                   /*!< channel commutation interrupt flag */
#define TIMER_INT_TRG                            TIMER_DMAINTEN_TRGIE                   /*!< trigger interrupt */
#define TIMER_INT_BRK                            TIMER_DMAINTEN_BRKIE                   /*!< break interrupt */

/* TIMER flag */
#define TIMER_FLAG_UP                            TIMER_INTF_UPIF                        /*!< update flag */
#define TIMER_FLAG_CH0                           TIMER_INTF_CH0IF                       /*!< channel 0 capture/compare flag */
#define TIMER_FLAG_CH1                           TIMER_INTF_CH1IF                       /*!< channel 1 capture/compare flag */
#define TIMER_FLAG_CH2                           TIMER_INTF_CH2IF                       /*!< channel 2 capture/compare flag */
#define TIMER_FLAG_CH3                           TIMER_INTF_CH3IF                       /*!< channel 3 capture/compare flag */
#define TIMER_FLAG_CMT                           TIMER_INTF_CMTIF                       /*!< channel commutation flag */
#define TIMER_FLAG_TRG                           TIMER_INTF_TRGIF                       /*!< trigger flag */
#define TIMER_FLAG_BRK                           TIMER_INTF_BRKIF                       /*!< break flag */
#define TIMER_FLAG_CH0O                          TIMER_INTF_CH0OF                       /*!< channel 0 overcapture flag */
#define TIMER_FLAG_CH1O                          TIMER_INTF_CH1OF                       /*!< channel 1 overcapture flag */
#define TIMER_FLAG_CH2O                          TIMER_INTF_CH2OF                       /*!< channel 2 overcapture flag */
#define TIMER_FLAG_CH3O                          TIMER_INTF_CH3OF                       /*!< channel 3 overcapture flag */

/* TIMER interrupt flag */
#define TIMER_INT_FLAG_UP                        TIMER_INTF_UPIF                        /*!< update interrupt flag */
#define TIMER_INT_FLAG_CH0                       TIMER_INTF_CH0IF                       /*!< channel 0 capture/compare interrupt flag */
#define TIMER_INT_FLAG_CH1                       TIMER_INTF_CH1IF                       /*!< channel 1 capture/compare interrupt flag */
#define TIMER_INT_FLAG_CH2                       TIMER_INTF_CH2IF                       /*!< channel 2 capture/compare interrupt flag */
#define TIMER_INT_FLAG_CH3                       TIMER_INTF_CH3IF                       /*!< channel 3 capture/compare interrupt flag */
#define TIMER_INT_FLAG_CMT                       TIMER_INTF_CMTIF                       /*!< channel commutation interrupt flag */
#define TIMER_INT_FLAG_TRG                       TIMER_INTF_TRGIF                       /*!< trigger interrupt flag */
#define TIMER_INT_FLAG_BRK                       TIMER_INTF_BRKIF                       /*!< break interrupt flag */

