PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER DMA source enable */
#define TIMER_DMA_UPD                            ((uint16_t)TIMER_DMAINTEN_UPDEN)       /*!< update DMA request enable */
#define TIMER_DMA_CH0D                           ((uint16_t)TIMER_DMAINTEN_CH0DEN)      /*!< channel 0 capture/compare DMA request enable */
#define TIMER_DMA_CH1D                           ((uint16_t)TIMER_DMAINTEN_CH1DEN)      /*!< channel 1 capture/compare DMA request enable */
#define TIMER_DMA_CH2D                           ((uint16_t)TIMER_DMAINTEN_CH2DEN)      /*!< channel 2 capture/compare DMA request enable */
#define TIMER_DMA_CH3D                           ((uint16_t)TIMER_DMAINTEN_CH3DEN)      /*!< channel 3 capture/compare DMA request enable */
#define TIMER_DMA_CMTD                           ((uint16_t)TIMER_DMAINTEN_CMTDEN)      /*!< commutation DMA request enable */
#define TIMER_DMA_TRGD                           ((uint16_t)TIMER_DMAINTEN_TRGDEN)      /*!< trigger DMA request enable */

/* DMA device information index */
#define TIMER_DMA_ID_UP                          ((uint8_t) 0x0U)                       /*!< specify update DMA request */
#define TIMER_DMA_ID_CH0                         ((uint8_t) 0x1U)                       /*!< specify channel 0 DMA request */
#define TIMER_DMA_ID_CH1                         ((uint8_t) 0x2U)                       /*!< specify channel 1 DMA request */
#define TIMER_DMA_ID_CH2                         ((uint8_t) 0x3U)                       /*!< specify channel 2 DMA request */
#define TIMER_DMA_ID_CH3                         ((uint8_t) 0x4U)                       /*!< specify channel 3 DMA request */
#define TIMER_DMA_ID_CMT                         ((uint8_t) 0x5U)                       /*!< specify commutation DMA request */
#define TIMER_DMA_ID_TRG                         ((uint8_t) 0x6U)                       /*!< specify trigger DMA request */

/* channel DMA request source selection */
#define TIMER_DMAREQUEST_UPDATEEVENT             TIMER_CTL1_DMAS                        /*!< DMA request of channel y is sent when update event occurs */
#define TIMER_DMAREQUEST_CHANNELEVENT            ((uint32_t)0x00000000U)                /*!< DMA request of channel y is sent when channel y event occurs */

/* TIMER software event generation source */
#define TIMER_EVENT_SRC_UPG                      ((uint16_t)0x0001U)                    /*!< update event generation */
#define TIMER_EVENT_SRC_CH0G                     ((uint16_t)0x0002U)                    /*!< channel 0 capture or compare event generation */
#define TIMER_EVENT_SRC_CH1G                     ((uint16_t)0x0004U)                    /*!< channel 1 capture or compare event generation */
#define TIMER_EVENT_SRC_CH2G                     ((uint16_t)0x0008U)                    /*!< channel 2 capture or compare event generation */
#define TIMER_EVENT_SRC_CH3G                     ((uint16_t)0x0010U)                    /*!< channel 3 capture or compare event generation */
#define TIMER_EVENT_SRC_CMTG                     ((uint16_t)0x0020U)                    /*!< channel commutation event generation */
#define TIMER_EVENT_SRC_TRGG                     ((uint16_t)0x0040U)                    /*!< trigger event generation */
#define TIMER_EVENT_SRC_BRKG                     ((uint16_t)0x0080U)                    /*!< break event generation */

/* TIMER prescaler reload mode */
#define TIMER_PSC_RELOAD_NOW                     TIMER_SWEVG_UPG                        /*!< the prescaler value is loaded right now */
#define TIMER_PSC_RELOAD_UPDATE                  ((uint32_t)0x00000000U)                /*!< the prescaler value is loaded at the next update event */

/* single pulse mode */
#define TIMER_SP_MODE_SINGLE                     TIMER_CTL0_SPM                         /*!< single pulse mode */
#define TIMER_SP_MODE_REPETITIVE                 ((uint32_t)0x00000000U)                /*!< repetitive pulse mode */

/* update source */
#define TIMER_UPDATE_SRC_REGULAR                 TIMER_CTL0_UPS                         /*!< update generate only by counter overflow/underflow */
#define TIMER_UPDATE_SRC_GLOBAL                  ((uint32_t)0x00000000U)                /*!< update generate by setting of UPG bit or the counter overflow/underflow,or the slave mode controller trigger */

/* TIMER channel */
#define TIMER_CH_0_1                             ((uint16_t)0x0004U)                    /*!< TIMER channel 0 and 1 for decoder function parameter */

/* channel enable state*/
#define TIMER_CCX_ENABLE                         ((uint32_t)0x00000001U)                /*!< channel enable */
#define TIMER_CCX_DISABLE                        ((uint32_t)0x00000000U)                /*!< channel disable */

/* channel complementary output enable state*/
#define TIMER_CCXN_ENABLE                        ((uint16_t)0x0004U)                    /*!< channel complementary enable */
#define TIMER_CCXN_DISABLE                       ((uint16_t)0x0000U)                    /*!< channel complementary disable */

/* channel control shadow register update control */
#define TIMER_UPDATECTL_CCU                      ((uint32_t)0x00000000U)                /*!< the shadow registers are updated when CMTG bit is set */
#define TIMER_UPDATECTL_CCUTRI                   TIMER_CTL1_CCUC                        /*!< the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs */

/* OCPRE clear source selection */
#define TIMER_OCPRE_CLEAR_SOURCE_CLR             ((uint8_t)0x00U)                       /*!< OCPRE_CLR_INT is connected to the OCPRE_CLR input */
#define TIMER_OCPRE_CLEAR_SOURCE_ETIF            ((uint8_t)0x01U)                       /*!< OCPRE_CLR_INT is connected to ETIF */

/* TIMERx(x=0,2,13,14,15,16) write cc register selection */
#define TIMER_CHVSEL_ENABLE                      ((uint16_t)TIMER_CFG_CHVSEL)           /*!< write CHxVAL register selection enable */
#define TIMER_CHVSEL_DISABLE                     ((uint16_t)0x0000U)                    /*!< write CHxVAL register selection disable */

/* the output value selection */
#define TIMER_OUTSEL_ENABLE                      ((uint16_t)TIMER_CFG_OUTSEL)           /*!< output value selection enable */
#define TIMER_OUTSEL_DISABLE                     ((uint16_t)0x0000U)                    /*!< output value selection disable */

/* timer13 channel 0 input remap */
#define TIMER13_IRMP(regval)                     (BITS(0, 1) & ((uint32_t)(regval) << 0U))
#define TIMER13_CI0_RMP_GPIO                     TIMER13_IRMP(0)                        /*!< timer13 channel 0 input is connected to GPIO(TIMER13_CH0) */
#define TIMER13_CI0_RMP_RTCCLK                   TIMER13_IRMP(1)                        /*!< timer13 channel 0 input is connected to the RTCCLK */
#define TIMER13_CI0_RMP_HXTAL_DIV32              TIMER13_IRMP(2)                        /*!< timer13 channel 0 input is connected to HXTAL/32 clock */
#define TIMER13_CI0_RMP_CKOUTSEL                 TIMER13_IRMP(3)                        /*!< timer13 channel 0 input is connected to CKOUTSEL */

/* channel mask */
#define TIMER_CHX_EN_MASK                        ((uint32_t)(TIMER_CHCTL2_CH0EN|\
                                                             TIMER_CHCTL2_CH1EN|TIMER_CHCTL2_CH2EN|\
                                                             TIMER_CHCTL2_CH3EN))       /*!< channel enable mask */
#define TIMER_CHNX_EN_MASK                       ((uint32_t)(TIMER_CHCTL2_CH0NEN|\
                                                             TIMER_CHCTL2_CH1NEN|\
                                                             TIMER_CHCTL2_CH2NEN))      /*!< complementary channel enable mask */

/* registers address definitions */
#define TIMER_CTL0_ADDRESS(timerx)               (uint32_t)((timerx) + 0x00U)           /*!< TIMER control register 0 */
#define TIMER_CTL1_ADDRESS(timerx)               (uint32_t)((timerx) + 0x04U)           /*!< TIMER control register 1 */
#define TIMER_SMCFG_ADDRESS(timerx)              (uint32_t)((timerx) + 0x08U)           /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN_ADDRESS(timerx)           (uint32_t)((timerx) + 0x0CU)           /*!< TIMER DMA and interrupt enable register */
#define TIMER_INTF_ADDRESS(timerx)               (uint32_t)((timerx) + 0x10U)           /*!< TIMER interrupt flag register */
#define TIMER_SWEVG_ADDRESS(timerx)              (uint32_t)((timerx) + 0x14U)           /*!< TIMER software event generation register */
#define TIMER_CHCTL0_ADDRESS(timerx)             (uint32_t)((timerx) + 0x18U)           /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1_ADDRESS(timerx)             (uint32_t)((timerx) + 0x1CU)           /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2_ADDRESS(timerx)             (uint32_t)((timerx) + 0x20U)           /*!< TIMER channel control register 2 */
#define TIMER_CNT_ADDRESS(timerx)                (uint32_t)((timerx) + 0x24U)           /*!< TIMER counter register */
#define TIMER_PSC_ADDRESS(timerx)                (uint32_t)((timerx) + 0x28U)           /*!< TIMER prescaler register */
#define TIMER_CAR_ADDRESS(timerx)                (uint32_t)((timerx) + 0x2CU)           /*!< TIMER counter auto reload register */
#define TIMER_CREP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x30U)           /*!< TIMER counter repetition register */
#define TIMER_CH0CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x34U)           /*!< TIMER channel 0 capture/compare value register */
#define TIMER_CH1CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x38U)           /*!< TIMER channel 1 capture/compare value register */
#define TIMER_CH2CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x3CU)           /*!< TIMER channel 2 capture/compare value register */
#define TIMER_CH3CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x40U)           /*!< TIMER channel 3 capture/compare value register */
#define TIMER_CCHP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x44U)           /*!< TIMER complementary channel protection register */
#define TIMER_DMACFG_ADDRESS(timerx)             (uint32_t)((timerx) + 0x48U)           /*!< TIMER DMA configuration register */
#define TIMER_DMATB_ADDRESS(timerx)              (uint32_t)((timerx) + 0x4CU)           /*!< TIMER DMA transfer buffer register */
#define TIMER_IRMP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x50U)           /*!< TIMER channel input remap register */
#define TIMER_CFG_ADDRESS(timerx)                (uint32_t)((timerx) + 0xFCU)           /*!< TIMER configuration register */

