PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER timebase initialize */
/* @STRUCT_MEMBER: prescaler */
/* @=NULL */
/* @STRUCT_MEMBER: alignedmode */
/* @DEFINE: counter alignment mode */
#define TIMER_COUNTER_EDGE                       CTL0_CAM(0)                            /*!< edge-aligned mode */
#define TIMER_COUNTER_CENTER_DOWN                CTL0_CAM(1)                            /*!< center-aligned and counting down assert mode */
#define TIMER_COUNTER_CENTER_UP                  CTL0_CAM(2)                            /*!< center-aligned and counting up assert mode */
#define TIMER_COUNTER_CENTER_BOTH                CTL0_CAM(3)                            /*!< center-aligned and counting up/down assert mode */
/* @STRUCT_MEMBER: counter_direction */
/* @DEFINE: counter direction */
#define TIMER_COUNTER_UP                         ((uint16_t)0x0000U)                    /*!< counting up direction */
#define TIMER_COUNTER_DOWN                       ((uint16_t)0x0010U)                    /*!< counting down direction */
/* @STRUCT_MEMBER: period */
/* @=NULL */
/* @STRUCT_MEMBER: clock_division */
/* @DEFINE: specify division ratio between TIMER clock and dead-time and sampling clock */
#define TIMER_CKDIV_DIV1                         CTL0_CKDIV(0)                          /*!< clock division value is 1, fDTS = fCK_TIMER */
#define TIMER_CKDIV_DIV2                         CTL0_CKDIV(1)                          /*!< clock division value is 2, fDTS = fCK_TIMER/2 */
#define TIMER_CKDIV_DIV4                         CTL0_CKDIV(2)                          /*!< clock division value is 4, fDTS = fCK_TIMER/4 */
/* @STRUCT_MEMBER: repetition_counter */
/* @=NULL */
/* @STRUCT_MEMBER: autoreload_shadow */
/* @DEFINE: counter auto reload shadow enable */
#define TIMER_CARL_SHADOW_ENABLE                 (TIMER_CTL0_ARSE)                      /*!< channel output shadow state enable */
#define TIMER_CARL_SHADOW_DISABLE                ((uint32_t)0x00000000U)                /*!< channel output shadow state disable */
/* @STRUCT_MEMBER: master_slave_mode */
/* @SP: ENABLE/DISABLE */
#define TIMER_MASTER_SLAVE_MODE_ENABLE           (TIMER_SMCFG_MSM)                      /*!< master slave mode enable */
#define TIMER_MASTER_SLAVE_MODE_DISABLE          ((uint32_t)0x00000000U)                /*!< master slave mode disable */
/* @STRUCT_MEMBER: trgo_selection */
/* @ENUM: master mode control */
typedef enum {
    TIMER_TRI_OUT_SRC_RESET  = CTL1_MMC(0),                                             /*!< the UPG bit as trigger output */
    TIMER_TRI_OUT_SRC_ENABLE = CTL1_MMC(1),                                             /*!< the counter enable signal TIMER_CTL0_CEN as trigger output */
    TIMER_TRI_OUT_SRC_UPDATE = CTL1_MMC(2),                                             /*!< update event as trigger output */
    TIMER_TRI_OUT_SRC_CH0    = CTL1_MMC(3),                                             /*!< a capture or a compare match occurred in channal0 as trigger output TRGO */
    TIMER_TRI_OUT_SRC_O0CPRE = CTL1_MMC(4),                                             /*!< O0CPRE as trigger output */
    TIMER_TRI_OUT_SRC_O1CPRE = CTL1_MMC(5),                                             /*!< O1CPRE as trigger output */
    TIMER_TRI_OUT_SRC_O2CPRE = CTL1_MMC(6),                                             /*!< O2CPRE as trigger output */
    TIMER_TRI_OUT_SRC_O3CPRE = CTL1_MMC(7)                                              /*!< O3CPRE as trigger output */
} hal_timer_trgo_selection_enum;
/* @PARA: timer */
/* @STRUCT: TIMER timebase initialize configuration structure */
typedef struct {
    uint16_t prescaler;                                                                 /*!< prescaler value, TIMERx_PSC */
    uint16_t alignedmode;                                                               /*!< counter alignment mode */
    uint16_t counter_direction;                                                         /*!< counter direction */
    uint32_t period;                                                                    /*!< period value, TIMERx_CAR */
    uint16_t clock_division;                                                            /*!< clock division value */
    uint8_t  repetition_counter;                                                        /*!< the counter repetition value, TIMERx_CREP */
    uint32_t autoreload_shadow;                                                         /*!< auto-reload shadow enable or disable, TIMERx_CTL0:bit7(ARSE) */
    uint32_t master_slave_mode;                                                         /*!< master-slave mode enable or disable, TIMERx_SMCFG:bit7(MSM) */
    hal_timer_trgo_selection_enum trgo_selection;                                       /*!< master mode control, TIMERx_CTL1:bit4~6(MMC) */
} hal_timer_init_struct;
/* @FUNCTION: initialize TIMER timebase */
int32_t hal_timer_init(hal_timer_dev_struct *timer_dev,uint32_t periph ,hal_timer_init_struct *timer);

/* TIMER input capture mode configuration */
/* @PARA: channel */
/* @DEFINE: TIMER channel n(n=0,1,2,3) */
#define TIMER_CH_0                               ((uint16_t)0x0000U)                    /*!< TIMER channel 0(TIMERx(x=0..2,13..16)) */
#define TIMER_CH_1                               ((uint16_t)0x0001U)                    /*!< TIMER channel 1(TIMERx(x=0..2,14)) */
#define TIMER_CH_2                               ((uint16_t)0x0002U)                    /*!< TIMER channel 2(TIMERx(x=0..2)) */
#define TIMER_CH_3                               ((uint16_t)0x0003U)                    /*!< TIMER channel 3(TIMERx(x=0..2)) */
/* @STRUCT_MEMBER: ic_polarity */
/* @DEFINE: channel input capture polarity */
#define TIMER_IC_POLARITY_RISING                 ((uint16_t)0x0000U)                    /*!< input capture rising edge */
#define TIMER_IC_POLARITY_FALLING                ((uint16_t)0x0002U)                    /*!< input capture falling edge */
#define TIMER_IC_POLARITY_BOTH_EDGE              ((uint16_t)0x000AU)                    /*!< input capture both edge */
/* @STRUCT_MEMBER: ic_selection */
/* @DEFINE: channel input capture selection */
#define TIMER_IC_SELECTION_DIRECTTI              ((uint16_t)0x0001U)                    /*!< channel y is configured as input and icy is mapped on CIy */
#define TIMER_IC_SELECTION_INDIRECTTI            ((uint16_t)0x0002U)                    /*!< channel y is configured as input and icy is mapped on opposite input */
#define TIMER_IC_SELECTION_ITS                   ((uint16_t)0x0003U)                    /*!< channel y is configured as input and icy is mapped on ITS */
/* @STRUCT_MEMBER: ic_prescaler */
/* @DEFINE: channel input capture prescaler */
#define TIMER_IC_PRESCALER_OFF                   ((uint16_t)0x0000U)                    /*!< no prescaler */
#define TIMER_IC_PRESCALER_DIV2                  ((uint16_t)0x0004U)                    /*!< divided by 2 */
#define TIMER_IC_PRESCALER_DIV4                  ((uint16_t)0x0008U)                    /*!< divided by 4*/
#define TIMER_IC_PRESCALER_DIV8                  ((uint16_t)0x000CU)                    /*!< divided by 8 */
/* @STRUCT_MEMBER: ic_filter */
/* @=NULL */
/* @PARA: timer_inputcapture */
/* @STRUCT: TIMER input capture configuration structure */
typedef struct {
    uint16_t ic_polarity;                                                               /*!< channel input capture polarity */
    uint16_t ic_selection;                                                              /*!< channel input capture source selection */
    uint16_t ic_prescaler;                                                              /*!< channel input capture prescaler */
    uint16_t ic_filter;                                                                 /*!< channel input capture filter, 0x00~0x0F */
} hal_timer_input_capture_struct;
