PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* @FUNCTION: configure TIMER input capture mode */
int32_t hal_timer_input_capture_config(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_input_capture_struct *timer_inputcapture);

/* TIMER output compare mode configuration */
/* @PARA: channel */
/* @DEFINE: TIMER channel n(n=0,1,2,3) */
/* @REFER: TIMER_CH_0 */
/* @STRUCT_MEMBER: compare_mode */
/* @ENUM: TIMER channel compare output control */
typedef enum {
    TIMER_OC_MODE_TIMING   = ((uint16_t)0x0000U),                                       /*!< timing mode */
    TIMER_OC_MODE_ACTIVE   = ((uint16_t)0x0010U),                                       /*!< active mode, set on match */
    TIMER_OC_MODE_INACTIVE = ((uint16_t)0x0020U),                                       /*!< inactive mode, clear on match */
    TIMER_OC_MODE_TOGGLE   = ((uint16_t)0x0030U),                                       /*!< toggle mode */
    TIMER_OC_MODE_LOW      = ((uint16_t)0x0040U),                                       /*!< force low mode */
    TIMER_OC_MODE_HIGH     = ((uint16_t)0x0050U),                                       /*!< force high mode */
    TIMER_OC_MODE_PWM0     = ((uint16_t)0x0060U),                                       /*!< PWM0 mode */
    TIMER_OC_MODE_PWM1     = ((uint16_t)0x0070U)                                        /*!< PWM1 mode*/
} hal_timer_output_compare_enum;
/* @STRUCT_MEMBER: oc_pulse_value */
/* @=NULL */
/* @STRUCT_MEMBER: oc_polarity */
/* @DEFINE: channel output polarity */
#define TIMER_OC_POLARITY_HIGH                   ((uint16_t)0x0000U)                    /*!< channel output polarity is high */
#define TIMER_OC_POLARITY_LOW                    ((uint16_t)0x0002U)                    /*!< channel output polarity is low */
/* @STRUCT_MEMBER: ocn_polarity */
/* @DEFINE: channel complementary output polarity */
#define TIMER_OCN_POLARITY_HIGH                  ((uint16_t)0x0000U)                    /*!< channel complementary output polarity is high */
#define TIMER_OCN_POLARITY_LOW                   ((uint16_t)0x0008U)                    /*!< channel complementary output polarity is low */
/* @STRUCT_MEMBER: oc_idlestate */
/* @DEFINE: idle state of channel output */
#define TIMER_OC_IDLE_STATE_HIGH                 ((uint16_t)0x0100)                     /*!< idle state of channel output is high */
#define TIMER_OC_IDLE_STATE_LOW                  ((uint16_t)0x0000)                     /*!< idle state of channel output is low */
/* @STRUCT_MEMBER: ocn_idlestate */
/* @DEFINE: idle state of channel complementary output */
#define TIMER_OCN_IDLE_STATE_HIGH                ((uint16_t)0x0200U)                    /*!< idle state of channel complementary output is high */
#define TIMER_OCN_IDLE_STATE_LOW                 ((uint16_t)0x0000U)                    /*!< idle state of channel complementary output is low */
/* @STRUCT_MEMBER: oc_shadow */
/* @DEFINE: channel output compare shadow enable or disable */
#define TIMER_OC_SHADOW_ENABLE                   ((uint16_t)0x0008U)                    /*!< channel output compare shadow enable */
#define TIMER_OC_SHADOW_DISABLE                  ((uint16_t)0x0000U)                    /*!< channel output compare shadow disable */
/* @STRUCT_MEMBER: oc_fastmode */
/* @DEFINE: channel output compare fast enable */
#define TIMER_OC_FAST_ENABLE                     ((uint16_t)0x0004)                     /*!< channel output fast function enable */
#define TIMER_OC_FAST_DISABLE                    ((uint16_t)0x0000)                     /*!< channel output fast function disable */
/* @STRUCT_MEMBER: oc_clearmode */
/* @DEFINE: channel output compare clear enable */
#define TIMER_OC_CLEAR_ENABLE                    ((uint16_t)0x0080U)                    /*!< channel output clear function enable */
#define TIMER_OC_CLEAR_DISABLE                   ((uint16_t)0x0000U)                    /*!< channel output clear function disable */
/* @PARA: timer_outputcompare */
/* @STRUCT: TIMER output compare configuration structure */
typedef struct {
    hal_timer_output_compare_enum compare_mode;                                         /*!< channel output compare mode control */
    uint32_t oc_pulse_value;                                                            /*!< channel capture or compare value */
    uint16_t oc_polarity;                                                               /*!< channel output polarity */
    uint16_t ocn_polarity;                                                              /*!< channel complementary output polarity */
    uint16_t oc_idlestate;                                                              /*!< idle state of channel output */
    uint16_t ocn_idlestate;                                                             /*!< idle state of channel complementary output */
    uint16_t oc_shadow;                                                                 /*!< channel output compare shadow */
    uint16_t oc_fastmode;                                                               /*!< channel output compare fast mode */
    uint16_t oc_clearmode;                                                              /*!< channel output compare clear mode */
} hal_timer_output_compare_struct;
/* @FUNCTION: configure TIMER output compare mode */
int32_t hal_timer_output_compare_config(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_output_compare_struct *timer_outputcompare);

/* BREAK and complementary channel protection configuration */
/* @STRUCT_MEMBER: run_offstate */
/* @DEFINE: run mode off-state configure */
#define TIMER_ROS_STATE_ENABLE                   ((uint16_t)TIMER_CCHP_ROS)             /*!< when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits */
#define TIMER_ROS_STATE_DISABLE                  ((uint16_t)0x0000U)                    /*!< when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are disabled */
/* @STRUCT_MEMBER: idel_offstate */
/* @DEFINE: idle mode off-state configure */
#define TIMER_IOS_STATE_ENABLE                   ((uint16_t)TIMER_CCHP_IOS)             /*!< when POEN bit is reset, he channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits */
#define TIMER_IOS_STATE_DISABLE                  ((uint16_t)0x0000U)                    /*!< when POEN bit is reset, the channel output signals (CHx_O/CHx_ON) are disabled */
/* @STRUCT_MEMBER: dead_time */
/* @=NULL */
/* @STRUCT_MEMBER: break_polarity */
/* @DEFINE: break input polarity */
#define TIMER_BREAK_POLARITY_LOW                 ((uint16_t)0x0000U)                    /*!< break input polarity is low */
#define TIMER_BREAK_POLARITY_HIGH                ((uint16_t)TIMER_CCHP_BRKP)            /*!< break input polarity is high */
/* @STRUCT_MEMBER: output_autostate */
/* @DEFINE: output automatic enable */
#define TIMER_OUTAUTO_ENABLE                     ((uint16_t)TIMER_CCHP_OAEN)            /*!< output automatic enable */
#define TIMER_OUTAUTO_DISABLE                    ((uint16_t)0x0000U)                    /*!< output automatic disable */
/* @STRUCT_MEMBER: protect_mode */
/* @DEFINE: complementary register protect control */
#define TIMER_CCHP_PROT_OFF                      CCHP_PROT(0)                           /*!< protect disable */
#define TIMER_CCHP_PROT_0                        CCHP_PROT(1)                           /*!< PROT mode 0 */
#define TIMER_CCHP_PROT_1                        CCHP_PROT(2)                           /*!< PROT mode 1 */
#define TIMER_CCHP_PROT_2                        CCHP_PROT(3)                           /*!< PROT mode 2 */
/* @STRUCT_MEMBER: break_state */
/* @DEFINE: break input enable */
#define TIMER_BREAK_ENABLE                       ((uint16_t)TIMER_CCHP_BRKEN)           /*!< break input enable */
#define TIMER_BREAK_DISABLE                      ((uint16_t)0x0000U)                    /*!< break input disable */
/* @PARA: timer_break */
/* @STRUCT: break and complementary channel protection configuration structure */
typedef struct {
    uint16_t run_offstate;                                                              /*!< run mode off-state */
    uint16_t idel_offstate;                                                             /*!< idle mode off-state */
    uint16_t dead_time;                                                                 /*!< dead time */
    uint16_t break_polarity;                                                            /*!< break polarity */
    uint16_t output_autostate;                                                          /*!< output automatic enable */
    uint16_t protect_mode;                                                              /*!< complementary register protect control */
    uint16_t break_state;                                                               /*!< break enable */
} hal_timer_break_struct;
