PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* @FUNCTION: configure TIMER break function */
int32_t hal_timer_break_config(hal_timer_dev_struct *timer_dev, hal_timer_break_struct *timer_break);

/* TIMER OxCPRE clear source configuration */
/* @STRUCT_MEMBER: clear_source */
/* @DEFINE: OCPRE clear source selection */
#define TIMER_OCPRE_CLEAR_SOURCE_CLR             ((uint8_t)0x00U)                       /*!< OCPRE_CLR_INT is connected to the OCPRE_CLR input */
#define TIMER_OCPRE_CLEAR_SOURCE_ETIF            ((uint8_t)0x01U)                       /*!< OCPRE_CLR_INT is connected to ETIF */
/* @STRUCT_MEMBER: exttrigger_polarity */
/* @DEFINE: external trigger polarity */
#define TIMER_EXT_TRI_POLARITY_RISING            ((uint32_t)0x00000000U)                /*!< active high or rising edge active */
#define TIMER_EXT_TRI_POLARITY_FALLING           (TIMER_SMCFG_ETP)                      /*!< active low or falling edge active */
/* @STRUCT_MEMBER: exttrigger_prescaler */
/* @DEFINE: external trigger prescaler */
#define TIMER_EXT_TRI_PRESCALER_OFF              SMCFG_ETPSC(0)                         /*!< no divided */
#define TIMER_EXT_TRI_PRESCALER_DIV2             SMCFG_ETPSC(1)                         /*!< divided by 2 */
#define TIMER_EXT_TRI_PRESCALER_DIV4             SMCFG_ETPSC(2)                         /*!< divided by 4 */
#define TIMER_EXT_TRI_PRESCALER_DIV8             SMCFG_ETPSC(3)                         /*!< divided by 8 */
/* @STRUCT_MEMBER: exttrigger_filter */
/* @=NULL */
/* @PARA: timer_clearsource */
/* @STRUCT: TIMER OCPRE clear source configuration structure */
typedef struct {
    uint8_t clear_source;                                                               /*!< OCPRE clear source selection */
    uint32_t exttrigger_polarity;                                                       /*!< external trigger polarity */
    uint32_t exttrigger_prescaler;                                                      /*!< external trigger prescaler */
    uint32_t exttrigger_filter;                                                         /*!< external trigger filter, 0x00~0x0F */
} hal_timer_clear_source_struct;
/* @FUNCTION: configure TIMER OCPRE clear source */
int32_t hal_timer_ocpre_clear_source_config(hal_timer_dev_struct *timer_dev, hal_timer_clear_source_struct *timer_clearsource);

/* TIMER ci0 trigger input configuration */
/* @PARA: ci0_select */
/* @DEFINE: ci0 trigger input selection */
#define TIMER_CI0_XOR_CH012                      (TIMER_CTL1_TI0S)                      /*!< TIMER hall sensor mode enable */
#define TIMER_CI0_CH0IN                          ((uint32_t)0x00000000U)                /*!< TIMER hall sensor mode disable */
/* @FUNCTION: configure TIMER ci0 trigger input */
int32_t hal_timer_ci0_input_select(hal_timer_dev_struct *timer_dev, uint32_t ci0_select);

/* TIMER single pulse mode configuration */
/* @PARA: single_pulse */
/* @SP: ENABLE/DISABLE */
/* @FUNCTION: configure TIMER single pulse mode */
int32_t hal_timer_single_pulse_mode_config(hal_timer_dev_struct *timer_dev, uint32_t single_pulse);

/* clock source configuration */
/* @STRUCT_MEMBER: clock_source */
/* @ENUM: timer clock source select */
typedef enum{
    TIMER_CLOCK_SOURCE_CK_TIMER = (uint32_t)0x00000001,                                 /*!< clock input source selection:CK_TIMER, internal clock  */
    TIMER_CLOCK_SOURCE_ITI0     = TIMER_SMCFG_TRGSEL_ITI0,                              /*!< clock input source selection:ITI0,external clock mode 0 */
    TIMER_CLOCK_SOURCE_ITI1     = TIMER_SMCFG_TRGSEL_ITI1,                              /*!< clock input source selection:ITI1, external clock mode 0*/
    TIMER_CLOCK_SOURCE_ITI2     = TIMER_SMCFG_TRGSEL_ITI2,                              /*!< clock input source selection:ITI2, external clock mode 0*/
    TIMER_CLOCK_SOURCE_ITI3     = TIMER_SMCFG_TRGSEL_ITI3,                              /*!< clock input source selection:ITI3, external clock mode 0*/
    TIMER_CLOCK_SOURCE_CI0FE0   = TIMER_SMCFG_TRGSEL_CI0FE0,                            /*!< clock input source selection:CI0FE0, external clock mode 0 */
    TIMER_CLOCK_SOURCE_CI1FE1   = TIMER_SMCFG_TRGSEL_CI1FE1,                            /*!< clock input source selection:CI1FE1, external clock mode 0 */
    TIMER_CLOCK_SOURCE_CI0FED   = TIMER_SMCFG_TRGSEL_CI0F_ED,                           /*!< clock input source selection:CI0FED, external clock mode 0*/
    TIMER_CLOCK_SOURCE_ETIMODE0 = TIMER_SMCFG_TRGSEL_ETIFP,                             /*!< clock input source selection:ETI in external clock mode0 */
    TIMER_CLOCK_SOURCE_ETIMODE1 = TIMER_SMCFG_SMC1                                      /*!< clock input source selection:ETI in external clock mode1 */
} hal_timer_clock_source_enum;
/* @STRUCT_MEMBER: clock_polarity */
/* @DEFINE: clock input source polarity */
#define TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING  TIMER_EXT_TRI_POLARITY_RISING          /*!< clock or trigger input source is ETI, active high or rising edge active */
#define TIMER_CLOCK_TRIGGER_ETI_POLARITY_FALLING TIMER_EXT_TRI_POLARITY_FALLING         /*!< clock or trigger input source is ETI, active low or falling edge active */
#define TIMER_CLOCK_TRIGGER_POLARITY_RISING      (uint32_t)TIMER_IC_POLARITY_RISING     /*!< clock or trigger input source is CIx(x=0,1), rising edge active */
#define TIMER_CLOCK_TRIGGER_POLARITY_FALLING     (uint32_t)TIMER_IC_POLARITY_FALLING    /*!< clock or trigger input source is CIx(x=0,1), falling edge active */
#define TIMER_CLOCK_TRIGGER_POLARITY_BOTH_EDGE   (uint32_t)TIMER_IC_POLARITY_BOTH_EDGE  /*!< clock or trigger input source is CI0F_ED, both rising and falling edge active */
/* @STRUCT_MEMBER: clock_prescaler */
/* @DEFINE: clock input source prescaler for ETI */
/* @REFER: TIMER_EXT_TRI_PRESCALER_OFF */
/* @STRUCT_MEMBER: clock_filter */
/* @=NULL */
/* @PARA: timer_clocksource */
/* @STRUCT: TIMER clock source configuration structure */
typedef struct{
    hal_timer_clock_source_enum clock_source;                                           /*!< select clock input source */
    uint32_t clock_polarity;                                                            /*!< clock input source polarity */
    uint32_t clock_prescaler;                                                           /*!< clock input source prescaler */
    uint32_t clock_filter;                                                              /*!< clock input source filter, 0x00~0x0F */
}hal_timer_clock_source_struct;
