PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* @FUNCTION: configure TIMER clock source */
int32_t hal_timer_clock_source_config(hal_timer_dev_struct *timer_dev, hal_timer_clock_source_struct *timer_clocksource);

/* TIMER slave mode configuration */
/* @STRUCT_MEMBER: slavemode */
/* @ENUM: slave mode control */
typedef enum {
    TIMER_SLAVE_DISABLE_MODE      = TIMER_SLAVE_MODE_DISABLE,                           /*!< slave mode disable */
    TIMER_SLAVE_MODE_RESTART_MODE = TIMER_SLAVE_MODE_RESTART,                           /*!< restart mode */
    TIMER_SLAVE_MODE_PAUSE_MODE   = TIMER_SLAVE_MODE_PAUSE,                             /*!< pause mode */
    TIMER_SLAVE_MODE_EVENT_MODE   = TIMER_SLAVE_MODE_EVENT                              /*!< event mode */
} hal_timer_slave_mode_enum;
/* @STRUCT_MEMBER: trigger_selection */
/* @ENUM: trigger input source */
typedef enum{
    TIMER_TRIGGER_SOURCE_ITI0    = TIMER_SMCFG_TRGSEL_ITI0,                             /*!< trigger input source selection:ITI0 */
    TIMER_TRIGGER_SOURCE_ITI1    = TIMER_SMCFG_TRGSEL_ITI1,                             /*!< trigger input source selection:ITI1 */
    TIMER_TRIGGER_SOURCE_ITI2    = TIMER_SMCFG_TRGSEL_ITI2,                             /*!< trigger input source selection:ITI2 */
    TIMER_TRIGGER_SOURCE_ITI3    = TIMER_SMCFG_TRGSEL_ITI3,                             /*!< trigger input source selection:ITI3 */
    TIMER_TRIGGER_SOURCE_CI0FE0  = TIMER_SMCFG_TRGSEL_CI0FE0,                           /*!< trigger input source selection:CI0FE0 */
    TIMER_TRIGGER_SOURCE_CI1FE1  = TIMER_SMCFG_TRGSEL_CI1FE1,                           /*!< trigger input source selection:CI1FE1 */
    TIMER_TRIGGER_SOURCE_CI0FED  = TIMER_SMCFG_TRGSEL_CI0F_ED,                          /*!< trigger input source selection:CI0FED */
    TIMER_TRIGGER_SOURCE_ETIFP   = TIMER_SMCFG_TRGSEL_ETIFP,                            /*!< trigger input source selection:ETIFP */
    TIMER_TRIGGER_SOURCE_DISABLE = (uint32_t)0x00000001                                 /*!< trigger input source selection:none */
} hal_timer_input_trigger_source_enum;
/* @STRUCT_MEMBER: trigger_polarity */
/* @DEFINE: trigger input source polarity */
/* @REFER: TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING */
/* @STRUCT_MEMBER: trigger_prescaler */
/* @DEFINE: trigger input source prescaler */
/* @REFER: TIMER_EXT_TRI_PRESCALER_OFF */
/* @STRUCT_MEMBER: trigger_filter */
/* @=NULL */
/* @PARA: timer_slavemode */
/* @STRUCT: TIMER slave mode configuration structure */
typedef struct {
    hal_timer_slave_mode_enum slavemode;                                                /*!< slave mode control */
    hal_timer_input_trigger_source_enum trigger_selection;                              /*!< trigger selection */
    uint32_t trigger_polarity;                                                          /*!< trigger input source polarity */
    uint32_t trigger_prescaler;                                                         /*!< trigger input source prescaler */
    uint32_t trigger_filter;                                                            /*!< trigger input source filter, 0x00~0x0F */
} hal_timer_slave_mode_struct;
/* @FUNCTION: configure TIMER slave mode */
int32_t hal_timer_slave_mode_config(hal_timer_dev_struct *timer_dev, hal_timer_slave_mode_struct *timer_slavemode);

/* TIMER decoder mode configuration */
/* @STRUCT_MEMBER: decoder_mode */
/* @ENUM: timer decoder mode */
typedef enum {
    TIMER_QUADRATURE_DECODER_MODE0 = TIMER_QUAD_DECODER_MODE0,                          /*!< quadrature decoder mode 0 */
    TIMER_QUADRATURE_DECODER_MODE1 = TIMER_QUAD_DECODER_MODE1,                          /*!< quadrature decoder mode 1 */
    TIMER_QUADRATURE_DECODER_MODE2 = TIMER_QUAD_DECODER_MODE2                           /*!< quadrature decoder mode 2 */
} hal_timer_decoder_mode_enum;
/* @STRUCT_MEMBER: ci0_polarity */
/* @DEFINE: channel0 input capture polarity */
/* @REFER: TIMER_IC_POLARITY_RISING */
/* @STRUCT_MEMBER: ci0_selection */
/* @DEFINE: channel0 input capture source selection */
/* @REFER: TIMER_IC_SELECTION_DIRECTTI */
/* @STRUCT_MEMBER: ci0_prescaler */
/* @DEFINE: channel0 input capture prescaler */
/* @REFER: TIMER_IC_PRESCALER_OFF */
/* @STRUCT_MEMBER: ci0_filter */
/* @=NULL */
/* @STRUCT_MEMBER: ci1_polarity */
/* @DEFINE: channel1 input capture polarity */
/* @REFER: TIMER_IC_POLARITY_RISING */
/* @STRUCT_MEMBER: ci1_selection */
/* @DEFINE: channel1 input capture source selection */
/* @REFER: TIMER_IC_SELECTION_DIRECTTI */
/* @STRUCT_MEMBER: ci1_prescaler */
/* @DEFINE: channel1 input capture prescaler */
/* @REFER: TIMER_IC_PRESCALER_OFF */
/* @STRUCT_MEMBER: ci1_filter */
/* @=NULL */
/* @PARA: timer_decoder */
/* @STRUCT: decoder mode configuration structure */
typedef struct {
    hal_timer_decoder_mode_enum decoder_mode;                                           /*!< decoder mode */
    uint16_t ci0_polarity;                                                              /*!< channel0 input capture polarity */
    uint16_t ci0_selection;                                                             /*!< channel0 input capture source selection */
    uint16_t ci0_prescaler;                                                             /*!< channel0 input capture prescaler */
    uint16_t ci0_filter;                                                                /*!< channel0 input capture filter */
    uint16_t ci1_polarity;                                                              /*!< channel1 input capture polarity */
    uint16_t ci1_selection;                                                             /*!< channel1 input capture source selection */
    uint16_t ci1_prescaler;                                                             /*!< channel1 input capture prescaler */
    uint16_t ci1_filter;                                                                /*!< channel1 input capture filter */
} hal_timer_decoder_struct;
/* @FUNCTION: configure TIMER decoder mode */
int32_t hal_timer_decoder_config(hal_timer_dev_struct *timer_dev, hal_timer_decoder_struct *timer_decoder);

/* HALL sensor mode configuration */
/* @STRUCT_MEMBER: cmt_delay */
/* @=NULL */
/* @STRUCT_MEMBER: ci0_polarity */
/* @DEFINE: channel0 input capture polarity */
/* @REFER: TIMER_IC_POLARITY_RISING */
/* @STRUCT_MEMBER: ci0_selection */
/* @DEFINE: channel0 input capture source selection */
/* @REFER: TIMER_IC_SELECTION_DIRECTTI */
/* @STRUCT_MEMBER: ci0_prescaler */
/* @DEFINE: channel0 input capture prescaler */
/* @REFER: TIMER_IC_PRESCALER_OFF */
/* @STRUCT_MEMBER: ci0_filter */
/* @=NULL */
/* @PARA: timer_hallsensor */
/* @STRUCT: hall sensor mode configuration structure */
typedef struct {
    uint32_t cmt_delay;                                                                 /*!< commutation delay(channel 1 compare value) */
    uint16_t ci0_polarity;                                                              /*!< channel0 input capture polarity */
    uint16_t ci0_selection;                                                             /*!< channel0 input capture source selection */
    uint16_t ci0_prescaler;                                                             /*!< channel0 input capture prescaler */
    uint16_t ci0_filter;                                                                /*!< channel0 input capture filter */
} hal_timer_hall_sensor_struct;
