PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* @FUNCTION: configure TIMER hall sensor mode */
int32_t hal_timer_hall_sensor_config(hal_timer_dev_struct *timer_dev, hal_timer_hall_sensor_struct *timer_hallsensor);
/* @END */

/* TIMER single pulse mode channel configuration structure */
typedef struct{
    hal_timer_output_compare_enum sp_compare_mode;                                      /*!< channel_out compare output control */
    uint32_t sp_oc_pulse_value;                                                         /*!< channel_out compare value */
    uint16_t sp_oc_polarity;                                                            /*!< channel_out output polarity */
    uint16_t sp_ocn_polarity;                                                           /*!< channel_out complementary output polarity */
    uint16_t sp_oc_idlestate;                                                           /*!< idle state of channel_out output */
    uint16_t sp_ocn_idlestate;                                                          /*!< idle state of channel_out complementary output */
    uint16_t sp_oc_fastmode;                                                            /*!< channel_out output compare fast mode */
    uint16_t sp_oc_clearmode;                                                           /*!< channel_out output compare clear mode */
    uint16_t sp_ic_polarity;                                                            /*!< channel_in input capture polarity */
    uint16_t sp_ic_selection;                                                           /*!< channel_in I/O mode selection */
    uint16_t sp_ic_filter;                                                              /*!< channel_in input capture filter */
}hal_timer_single_pulse_struct;

/* function declarations */
/* TIMER initialize*/
/* initialize TIMER structure with the default values */
int32_t hal_timer_struct_init(hal_timer_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize TIMER and device structure */
int32_t hal_timer_deinit(hal_timer_dev_struct *timer_dev);

/* TIMER timebase */
/* start TIMER counter */
int32_t hal_timer_counter_start(hal_timer_dev_struct *timer_dev);
/* stop TIMER counter */
int32_t hal_timer_counter_stop(hal_timer_dev_struct *timer_dev);
/* start TIMER counter and update interrupt */
int32_t hal_timer_counter_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq);
/* stop TIMER counter and update interrupt */
int32_t hal_timer_counter_stop_interrupt(hal_timer_dev_struct *timer_dev);
/* start TIMER counter and update DMA request */
int32_t hal_timer_counter_start_dma(hal_timer_dev_struct *timer_dev, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length);
/* stop TIMER counter and update DMA request */
int32_t hal_timer_counter_stop_dma(hal_timer_dev_struct *timer_dev);

/* TIMER input capture */
/* start TIMER channel input capture mode */
int32_t hal_timer_input_capture_start(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER channel input capture mode */
int32_t hal_timer_input_capture_stop(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER channel input capture mode and channel interrupt */
int32_t hal_timer_input_capture_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq);
/* stop TIMER channel input capture mode and channel interrupt */
int32_t hal_timer_input_capture_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER channel input capture mode and channel DMA request */
int32_t hal_timer_input_capture_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length);
/* stop TIMER channel input capture mode and channel DMA request */
int32_t hal_timer_input_capture_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* TIMER output compare */
/* start TIMER channel output compare mode */
int32_t hal_timer_output_compare_start(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER channel output compare mode */
int32_t hal_timer_output_compare_stop(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER channel output compare mode and channel interrupt */
int32_t hal_timer_output_compare_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq);
/* stop TIMER channel output compare mode and channel interrupt */
int32_t hal_timer_output_compare_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER channel output compare mode and channel DMA request */
int32_t hal_timer_output_compare_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length);
/* stop TIMER channel output compare mode and channel DMA request */
int32_t hal_timer_output_compare_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* TIMER complementary channel output compare */
/* start TIMER complementary channel output compare mode */
int32_t hal_timer_output_compare_complementary_channel_start(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER complementary channel output compare mode */
int32_t hal_timer_output_compare_complementary_channel_stop(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary channel output compare mode and channel interrupt */
int32_t hal_timer_output_compare_complementary_channel_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq);
/* stop TIMER complementary channel output compare mode and channel interrupt */
int32_t hal_timer_output_compare_complementary_channel_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary channel output compare mode and channel DMA request */
int32_t hal_timer_output_compare_complementary_channel_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length);
/* stop TIMER complementary channel output compare mode and channel DMA request */
int32_t hal_timer_output_compare_complementary_channel_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* TIMER single pulse mode configure */
int32_t hal_timer_single_pulse_mode_channel_config(hal_timer_dev_struct *timer_dev, hal_timer_single_pulse_struct *timer_singlepulse, uint16_t channel_out, uint16_t channel_in);
/* start TIMER single pulse mode */
int32_t hal_timer_single_pulse_start(hal_timer_dev_struct *timer_dev);
/* stop TIMER single pulse mode */
int32_t hal_timer_single_pulse_stop(hal_timer_dev_struct *timer_dev);
/* start TIMER single pulse mode and channel interrupt */
int32_t hal_timer_single_pulse_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq);
/* stop TIMER single pulse mode and channel interrupt */
int32_t hal_timer_single_pulse_stop_interrupt(hal_timer_dev_struct *timer_dev);
/* start TIMER complementary channel single pulse mode */
int32_t hal_timer_single_pulse_complementary_channel_start(hal_timer_dev_struct *timer_dev, uint16_t channel_out);
/* stop TIMER complementary channel single pulse mode */
int32_t hal_timer_single_pulse_complementary_channel_stop(hal_timer_dev_struct *timer_dev, uint16_t channel_out);
/* start TIMER complementary channel single pulse mode and channel interrupt */
int32_t hal_timer_single_pulse_complementary_channel_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel_out, hal_timer_irq_struct *p_irq);
/* stop TIMER complementary channel single pulse mode and channel interrupt */
int32_t hal_timer_single_pulse_complementary_channel_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel_out);

/* TIMER slave mode */
/* configure TIMER slave mode and interrupt */
int32_t hal_timer_slave_mode_interrupt_config(hal_timer_dev_struct *timer_dev, hal_timer_slave_mode_struct *timer_slavemode, hal_timer_irq_struct *p_irq);

/* TIMER decoder mode */
/* start TIMER decoder mode */
int32_t hal_timer_decoder_start(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER decoder mode */
int32_t hal_timer_decoder_stop(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER decoder mode and channel interrupt */
int32_t hal_timer_decoder_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq);
/* stop TIMER decoder mode and channel interrupt */
int32_t hal_timer_decoder_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER decoder mode and channel DMA request */
int32_t hal_timer_decoder_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, hal_timer_decoder_dma_config_struct *decoder_dma);
/* stop TIMER decoder mode and channel DMA request */
int32_t hal_timer_decoder_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* TIMER hall sensor mode */
/* start TIMER hall sensor mode */
int32_t hal_timer_hall_sensor_start(hal_timer_dev_struct *timer_dev);
/* stop TIMER hall sensor mode */
int32_t hal_timer_hall_sensor_stop(hal_timer_dev_struct *timer_dev);
/* start TIMER hall sensor mode and channel interrupt */
int32_t hal_timer_hall_sensor_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq);
/* stop TIMER hall sensor mode and channel interrupt */
int32_t hal_timer_hall_sensor_stop_interrupt(hal_timer_dev_struct *timer_dev);
/* start TIMER hall sensor mode and channel DMA request */
int32_t hal_timer_hall_sensor_start_dma(hal_timer_dev_struct *timer_dev, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length);
/* stop TIMER hall sensor mode and channel DMA request */
int32_t hal_timer_hall_sensor_stop_dma(hal_timer_dev_struct *timer_dev);

/* DMA mode settings*/
/* start TIMER DMA transfer mode for writing data to TIMER */
int32_t hal_timer_dma_transfer_write_start(hal_timer_dev_struct *timer_dev, uint32_t dmareq, hal_timer_dma_transfer_config_struct *dmatcfg, hal_timer_dma_handle_cb_struct *dmacb);
/* stop TIMER DMA transfer mode for writing data to TIMER */
int32_t hal_timer_dma_transfer_write_stop(hal_timer_dev_struct *timer_dev, uint32_t dmareq);
/* start TIMER DMA transfer mode for read data from TIMER */
int32_t hal_timer_dma_transfer_read_start(hal_timer_dev_struct *timer_dev, uint32_t dmareq, hal_timer_dma_transfer_config_struct *dmatcfg, hal_timer_dma_handle_cb_struct *dmacb);
/* stop TIMER DMA transfer mode for read data from TIMER */
int32_t hal_timer_dma_transfer_read_stop(hal_timer_dev_struct *timer_dev, uint32_t dmareq);

/* commutation control settings */
/* configure TIMER commutation event */
int32_t hal_timer_commutation_event_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source);
/* configure TIMER commutation event and enable CMT interrupt */
int32_t hal_timer_commutation_event_interrupt_config(hal_timer_dev_struct *timer_dev, uint32_t trigger_source, uint32_t com_source, hal_timer_irq_struct *p_irq);
/* configure TIMER commutation event and enable CMT DMA request */
int32_t hal_timer_commutation_event_dma_config(hal_timer_dev_struct *timer_dev, uint32_t trigger_source, uint32_t com_source, hal_timer_dma_handle_cb_struct *dmacb);

