PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_timer.h
/* TIMER interrupt callback */
/* set user-defined interrupt callback function */
int32_t hal_timer_irq_handle_set(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq);
/* reset all user-defined interrupt callback function */
int32_t hal_timer_irq_handle_all_reset(hal_timer_dev_struct *timer_dev);
/*  TIMER interrupt handler content function,which is merely used in timer_handler */
void hal_timer_irq(hal_timer_dev_struct *timer_dev);

/* TIMER timebase configuration */
/* enable a TIMER */
void hals_timer_enable(uint32_t timer_periph);
/* disable a TIMER */
void hals_timer_disable(uint32_t timer_periph);
/* enable the update event */
void hals_timer_update_event_enable(uint32_t timer_periph);
/* disable the update event */
void hals_timer_update_event_disable(uint32_t timer_periph);
/* configure TIMER update source */
void hals_timer_update_source_config(uint32_t timer_periph, uint8_t update);
/* set TIMER counter up direction */
void hals_timer_counter_up_direction(uint32_t timer_periph);
/* set TIMER counter down direction */
void hals_timer_counter_down_direction(uint32_t timer_periph);
/* set TIMER counter alignment mode */
void hals_timer_counter_alignment(uint32_t timer_periph, uint16_t aligned);
/* enable the auto reload shadow function */
void hals_timer_auto_reload_shadow_enable(uint32_t timer_periph);
/* disable the auto reload shadow function */
void hals_timer_auto_reload_shadow_disable(uint32_t timer_periph);
/* configure TIMER counter register value */
void hals_timer_counter_value_config(uint32_t timer_periph, uint32_t counter);
/* read TIMER counter value */
uint32_t hals_timer_counter_read(uint32_t timer_periph);
/* configure TIMER prescaler */
void hals_timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint8_t pscreload);
/* read TIMER prescaler value */
uint16_t hals_timer_prescaler_read(uint32_t timer_periph);
/* configure TIMER autoreload register value */
void hals_timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload);
/* configure TIMER repetition register value */
void hals_timer_repetition_value_config(uint32_t timer_periph, uint16_t repetition);

/* TIMER commutation control configuration */
/* enable or disable channel capture/compare control shadow register */
void hals_timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure TIMER channel control shadow register update control */
void hals_timer_channel_control_shadow_update_config(uint32_t timer_periph, uint8_t ccuctl);

/* TIMER master and slave */
/* select TIMER master mode output trigger source */
void hals_timer_master_output_trigger_source_select(uint32_t timer_periph, hal_timer_trgo_selection_enum outrigger);
/* configure TIMER master slave mode */
void hals_timer_master_slave_mode_config(uint32_t timer_periph, uint32_t master_slave);
/* select TIMER input trigger source */
void hals_timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger);
/* select TIMER slave mode */
void hals_timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode);
/* configure TIMER external trigger input */
void hals_timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter);

/* TIMER interrupt and flag*/
/* get TIMER flags */
FlagStatus hals_timer_flag_get(uint32_t timer_periph, uint32_t flag);
/* clear TIMER flags */
void hals_timer_flag_clear(uint32_t timer_periph, uint32_t flag);
/* enable the TIMER interrupt */
void hals_timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt);
/* disable the TIMER interrupt */
void hals_timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt);
/* get timer interrupt flag */
FlagStatus hals_timer_interrupt_flag_get(uint32_t timer_periph, uint32_t interrupt);
/* clear TIMER interrupt flag */
void hals_timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t interrupt);

/* timer DMA and event*/
/* enable the TIMER DMA */
void hals_timer_dma_enable(uint32_t timer_periph, uint16_t dma);
/* disable the TIMER DMA */
void hals_timer_dma_disable(uint32_t timer_periph, uint16_t dma);
/* channel DMA request source selection */
void hals_timer_channel_dma_request_source_select(uint32_t timer_periph, uint8_t dma_request);
/* configure the TIMER DMA transfer */
void hals_timer_dma_transfer_config(uint32_t timer_periph, hal_timer_dma_transfer_start_address_enum dma_baseaddr, hal_timer_dma_transfer_length_enum dma_lenth);
/* software generate events */
void hals_timer_event_software_generate(uint32_t timer_periph, uint16_t event);

/* TIMER channel output */
/* configure TIMER channel output compare */
void hals_timer_channel_output_config(uint32_t timer_periph, uint16_t channel, hal_timer_output_compare_struct *timer_outputcompare);
/* configure TIMER channel output compare mode */
void hals_timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, hal_timer_output_compare_enum ocmode);
/* configure TIMER channel output pulse value */
void hals_timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse);
/* configure TIMER channel output shadow function */
void hals_timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* configure TIMER channel output fast function */
void hals_timer_channel_output_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast);
/* configure TIMER channel output clear function */
void hals_timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear);
/* configure TIMER channel output polarity */
void hals_timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity);
/* configure TIMER channel complementary output polarity */
void hals_timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity);
/* configure TIMER channel enable state */
void hals_timer_channel_output_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state);
/* configure TIMER channel complementary output enable state */
void hals_timer_channel_complementary_output_state_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnstate);

/* TIMER channel input */
/* configure TIMER channel input capture */
void hals_timer_channel_input_capture_config(uint32_t timer_periph, uint16_t channel, hal_timer_input_capture_struct *timer_inputcapture);
/* configure TIMER channel input capture prescaler value */
void hals_timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler);
/* read TIMER channel capture/compare register value */
uint32_t hals_timer_input_capture_register_read(uint32_t timer_periph, uint16_t channel);

/* TIMER channel complementary protection */
/* enable TIMER break function */
void hals_timer_break_enable(uint32_t timer_periph);
/* disable TIMER break function */
void hals_timer_break_disable(uint32_t timer_periph);
/* enable TIMER output automatic function */
void hals_timer_automatic_output_enable(uint32_t timer_periph);
/* disable TIMER output automatic function */
void hals_timer_automatic_output_disable(uint32_t timer_periph);

/* TIMER configure */
/* configure TIMERx remap function */
void hals_timer_channel_remap_config(uint32_t timer_periph, uint32_t remap);
/* configure TIMER write CHxVAL register selection */
void hals_timer_write_chxval_register_config(uint32_t timer_periph, uint16_t chvsel);
/* configure TIMER output value selection */
void hals_timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel);

#endif /* GD32F3X0_HAL_TIMER_H */
